
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетФактура") Тогда
		Заказ = ДанныеЗаполнения.Заказ;
		Заказчик = ДанныеЗаполнения.Заказчик;
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Категория = ДанныеЗаполнения.Категория;
		Для Каждого ТекСтрокаПереченьВыполняемыхРабот Из ДанныеЗаполнения.ПереченьВыполняемыхРабот Цикл
			НоваяСтрока = ПереченьВыполненныхРабот.Добавить();
			НоваяСтрока.Единицы = ТекСтрокаПереченьВыполняемыхРабот.Единицы;
			НоваяСтрока.Количество = ТекСтрокаПереченьВыполняемыхРабот.Количество;
			НоваяСтрока.НаименованиеВыполненныхРабот = ТекСтрокаПереченьВыполняемыхРабот.НаименованиеРаботы;
			НоваяСтрока.ИтоговаяСтоимость = ТекСтрокаПереченьВыполняемыхРабот.ИтоговаяСтоимость;
			НоваяСтрока.Цена = ТекСтрокаПереченьВыполняемыхРабот.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ВыполненныеРаботы Приход
	Движения.ВыполненныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьВыполненныхРабот Из ПереченьВыполненныхРабот Цикл
		Движение = Движения.ВыполненныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Заказ;
		Движение.Исполнитель = Исполнитель;
		Движение.Категория = Категория;
		Движение.Заказчик = Заказчик;
		Движение.НаименованиеВыполненныхРабот = ТекСтрокаПереченьВыполненныхРабот.НаименованиеВыполненныхРабот;
		Движение.Единицы = ТекСтрокаПереченьВыполненныхРабот.Единицы;
		Движение.Дата = Дата;
		Движение.Цена = ТекСтрокаПереченьВыполненныхРабот.Цена;
		Движение.Количество = ТекСтрокаПереченьВыполненныхРабот.Количество;
		Движение.СуммаСНДС = ТекСтрокаПереченьВыполненныхРабот.ИтоговаяСтоимость;
	КонецЦикла;
	
	// регистр График Приход
	Движения.График.Записывать = Истина;
	Движение = Движения.График.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Исполнитель = Исполнитель;
	Движение.Заказчик = Заказчик;
	Движение.Категория = Категория;
	Движение.ДатаЗавершения = Дата;
	Документ = Документы.СчетФактура.НайтиПоРеквизиту("Заказ", Заказ);
	Данные = Документ.ПолучитьОбъект();
	Движение.ДатаНачала = Данные.Дата;
	Движение.ДатаОкончания = Данные.ДатаОкончания;
	Если Дата > Данные.ДатаОкончания Тогда
		Движение.ВыполнениеПлана = "Не выполнен";
	Иначе
		Движение.ВыполнениеПлана = "Выполнен";
	КонецЕсли;
	Движение.Количество = 1;
КонецПроцедуры
