Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.СчетФактура.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактура.Дата,
	|	СчетФактура.ДатаОкончания,
	|	СчетФактура.Заказ,
	|	СчетФактура.Заказчик,
	|	СчетФактура.Исполнитель,
	|	СчетФактура.Категория,
	|	СчетФактура.Номер,
	|	СчетФактура.ПереченьВыполняемыхРабот.(
	|		НомерСтроки,
	|		НаименованиеРаботы,
	|		Цена,
	|		Количество,
	|		Единицы,
	|		ЗатратыНаМатериалы,
	|		СкидкаКлиента,
	|		НДС,
	|		ИтоговаяСтоимость
	|	)
	|ИЗ
	|	Документ.СчетФактура КАК СчетФактура
	|ГДЕ
	|	СчетФактура.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПереченьВыполняемыхРаботШапка = Макет.ПолучитьОбласть("ПереченьВыполняемыхРаботШапка");
	ОбластьПереченьВыполняемыхРабот = Макет.ПолучитьОбласть("ПереченьВыполняемыхРабот");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПереченьВыполняемыхРаботШапка);
		ВыборкаПереченьВыполняемыхРабот = Выборка.ПереченьВыполняемыхРабот.Выбрать();
		Пока ВыборкаПереченьВыполняемыхРабот.Следующий() Цикл
			ОбластьПереченьВыполняемыхРабот.Параметры.Заполнить(ВыборкаПереченьВыполняемыхРабот);
			ТабДок.Вывести(ОбластьПереченьВыполняемыхРабот, ВыборкаПереченьВыполняемыхРабот.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	Итоги = Макет.ПолучитьОбласть("Всего");
	СсылкаДокумента = Ссылка[0];
	Итоги.Параметры.Итог = СсылкаДокумента.ПереченьВыполняемыхРабот.Итог("ИтоговаяСтоимость");
	ТабДок.Вывести(Итоги);
КонецПроцедуры
