Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаЗаказ") Тогда
		Заказ = ДанныеЗаполнения.Заказ;
		Заказчик = ДанныеЗаполнения.Заказчик;
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Категория = ДанныеЗаполнения.Категория;
		Для Каждого ТекСтрокаПереченьВыполняемыхРабот Из ДанныеЗаполнения.ПереченьВыполняемыхРабот Цикл
			НоваяСтрока = ПереченьВыполняемыхРабот.Добавить();
			НоваяСтрока.Единицы = ТекСтрокаПереченьВыполняемыхРабот.Единицы;
			НоваяСтрока.Количество = ТекСтрокаПереченьВыполняемыхРабот.Количество;
			НоваяСтрока.НаименованиеРаботы = ТекСтрокаПереченьВыполняемыхРабот.НаименованиеРаботы;
			НоваяСтрока.Цена = ТекСтрокаПереченьВыполняемыхРабот.Цена;
			НоваяСтрока.ЗатратыНаМатериалы = ПолучитьЗатраты(Заказ, НоваяСтрока.НаименованиеРаботы);
			НоваяСтрока.СкидкаКлиента = ПолучитьСкидку(Заказчик);
			НоваяСтрока.НДС = ПолучениеНДС(Категория);
			НоваяСтрока.ИтоговаяСтоимость = (НоваяСтрока.Цена * НоваяСтрока.Количество + НоваяСтрока.ЗатратыНаМатериалы)
				* (1 + НоваяСтрока.НДС / 100) * (1 - НоваяСтрока.СкидкаКлиента / 100);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучениеНДС(Категория)
	Данные = РегистрыСведений.СтоимостьУслуги.СоздатьНаборЗаписей();
	Данные.Прочитать();
	Для каждого Запись из Данные Цикл
		Если Запись.КатегорияУслуги = Категория Тогда
			Возврат Запись.НДС;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ПолучитьЗатраты(Заказ, Работа)
	Док = Документы.ЗаказМатериалов.НайтиПоРеквизиту("Заказ", Заказ);
	Если Не Док.Пустая() Тогда
		Объект = Док.ПолучитьОбъект();
		Затраты = 0;
		Для каждого Строка из Объект.ПереченьТребуемыхМатериалов Цикл
			Если Строка.НаименованиеРаботы = Работа Тогда
				Затраты = Затраты + Строка.Стоимость;
			КонецЕсли;
		КонецЦикла;
		Возврат Затраты;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ПолучитьСкидку(Заказчик)
	Если Заказчик.ПерсональнаяСкидка = Истина Тогда
		Данные = РегистрыСведений.Клиент.СоздатьНаборЗаписей();
		Данные.Прочитать();
		Сообщить("йцу");
		Для каждого Запись из Данные Цикл
			Если Запись.ФИО = Заказчик.Наименование Тогда
				Возврат Запись.ПерсональнаяСкидка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат 0;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Доход Приход
	Движения.Доход.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьВыполняемыхРабот Из ПереченьВыполняемыхРабот Цикл
		Движение = Движения.Доход.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Заказ;
		Движение.Категория = Категория;
		Движение.Дата = Дата;
		Движение.Стоимость = ТекСтрокаПереченьВыполняемыхРабот.ИтоговаяСтоимость;
		Движение.СтоимостьУслуги = ТекСтрокаПереченьВыполняемыхРабот.Цена * ТекСтрокаПереченьВыполняемыхРабот.Количество;
		Движение.СтоимостьМатериалов = ТекСтрокаПереченьВыполняемыхРабот.ЗатратыНаМатериалы;
		Движение.НДС = ТекСтрокаПереченьВыполняемыхРабот.НДС;
		Движение.Скидка = ТекСтрокаПереченьВыполняемыхРабот.СкидкаКлиента;
	КонецЦикла;
КонецПроцедуры
