&НаСервере
Функция ПриИзмененииНаСервере(Категория)
	ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
	Возврат ЦенаКатегории;
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ЦенаКатегории = ПриИзмененииНаСервере(Объект.Категория);
	Для каждого Строка из Объект.ПереченьВыполняемыхРабот Цикл
		Строка.Цена = ЦенаКатегории;
		Строка.ИтоговаяСтоимость = (Строка.Цена * Строка.Количество + Строка.ЗатратыНаМатериалы)
			* (1 + Строка.НДС / 100) * (1 - Строка.СкидкаКлиента / 100);
	КонецЦикла;
КонецПроцедуры