Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НарядЗаказ") Тогда
		Категория = ДанныеЗаполнения.Категория;
		Заказ = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Материалы Приход
	Движения.Материалы.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьТребуемыхМатериалов Из ПереченьТребуемыхМатериалов Цикл
		Движение = Движения.Материалы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Заказ;
		Движение.Категория = Категория;
		Движение.Материал = ТекСтрокаПереченьТребуемыхМатериалов.Материал;
		Движение.Единицы = ТекСтрокаПереченьТребуемыхМатериалов.Единицы;
		Движение.Количество = ТекСтрокаПереченьТребуемыхМатериалов.Количество;
		Движение.Цена = ТекСтрокаПереченьТребуемыхМатериалов.Цена;
		Движение.Стоимость = ТекСтрокаПереченьТребуемыхМатериалов.Стоимость;
	КонецЦикла;
КонецПроцедуры
