&НаСервере
Функция КатегорияПриИзмененииНаСервере(Категория)
	ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
	Если ТипЗнч(ЦенаКатегории) = Тип("Булево") Тогда
		РегистрСведенийСоздание.СоздатьРегистр(Категория);
		ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
	КонецЕсли;
	Возврат ЦенаКатегории;
КонецФункции

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	ЦенаКатегории = КатегорияПриИзмененииНаСервере(Объект.Категория);
	Для каждого Строка из Объект.ПереченьВыполняемыхРабот Цикл
		Строка.Цена = ЦенаКатегории;
		Строка.Стоимость = Строка.Цена * Строка.Количество;
	КонецЦикла;
КонецПроцедуры