
Процедура ОбработкаПроведения(Отказ, Режим) 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Заказы Приход
	Движения.Заказы.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьВыполняемыхРабот Из ПереченьВыполняемыхРабот Цикл
		Движение = Движения.Заказы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Исполнитель = Исполнитель;
		Движение.Категория = Категория;
		Движение.Заказчик = Заказчик;
		Движение.НаименованиеРаботы = ТекСтрокаПереченьВыполняемыхРабот.НаименованиеРаботы;
		Движение.Единицы = ТекСтрокаПереченьВыполняемыхРабот.Единицы;
		Движение.Дата = Дата;
		Движение.Количество = ТекСтрокаПереченьВыполняемыхРабот.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемИзделияНаРемонт") Тогда
		Заказчик = Справочники.Клиент.НайтиПоРеквизиту("ЭлПочта", ДанныеЗаполнения.ЭлПочта);
	КонецЕсли;
КонецПроцедуры
