Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НарядЗаказ") Тогда
		Заказчик = ДанныеЗаполнения.Заказчик;
		Исполнитель = ДанныеЗаполнения.Исполнитель;
		Категория = ДанныеЗаполнения.Категория;
		Заказ = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПереченьВыполняемыхРабот Из ДанныеЗаполнения.ПереченьВыполняемыхРабот Цикл
			НоваяСтрока = ПереченьВыполняемыхРабот.Добавить();
			НоваяСтрока.Единицы = ТекСтрокаПереченьВыполняемыхРабот.Единицы;
			НоваяСтрока.Количество = ТекСтрокаПереченьВыполняемыхРабот.Количество;
			НоваяСтрока.НаименованиеРаботы = ТекСтрокаПереченьВыполняемыхРабот.НаименованиеРаботы;
			ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
			Если ТипЗнч(ЦенаКатегории) = Тип("Булево") Тогда
				РегистрСведенийСоздание.СоздатьРегистр(Категория);
				ЦенаКатегории = РегистрСведенийЦена.ПолучениеЦены(Категория);
			КонецЕсли;
			НоваяСтрока.Цена = ЦенаКатегории;
			НоваяСтрока.Стоимость = ЦенаКатегории * НоваяСтрока.Количество;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры