Процедура ОбработкаПроведения(Отказ, РежимПроведения)		
	// Регистр
	Клиент = РегистрыСведений.Клиент.СоздатьМенеджерЗаписи();
	Клиент.Период = ТекущаяДата();
	Клиент.ФИО = ФИО;
	Клиент.ДатаРождения = ДатаРождения;
	Клиент.Телефон = Телефон;
	Клиент.ЭлПотча = ЭлПочта;
	Клиент.ПерсональнаяСкидка = 0;
	
	// Справочник	
	ГруппаКлиентов = Справочники.Клиент.НайтиПоНаименованию(ФИО);
	Если ГруппаКлиентов.Пустая() Тогда
		ДобавитьКлиента();
		Клиент.Записать();
	Иначе
		НайденнаяДата = Истина;
		Выборка = Справочники.Клиент.Выбрать(ГруппаКлиентов);
		Пока Выборка.Следующий() Цикл
			Если Выборка.ДатаРождения = ДатаРождения Тогда
				Клинт = РегистрыСведений.Клиент.СоздатьНаборЗаписей();
				Клинт.Прочитать();
				индекс = 0;
				инд = 0;
				Пока индекс < Клинт.Количество() Цикл
					Если Клинт[индекс].ФИО = ФИО И Клинт[индекс].ДатаРождения = ДатаРождения Тогда
						инд = индекс;
					КонецЕсли;
					индекс = индекс + 1;
				КонецЦикла;
				Объект = Выборка.ПолучитьОбъект();
				Объект.Телефон = Телефон;
				Объект.ЭлПочта = ЭлПочта;
				Документ = Документы.СчетФактура.Выбрать(ПодсчетДаты(), ТекущаяДата());
				Сумма = 0;
				Пока Документ.Следующий() Цикл
					Если Документ.Заказчик.Наименование = ФИО Тогда
						Данные = Документ.ПереченьВыполняемыхРабот;
						Для каждого Строка из Данные Цикл
							Сумма = Сумма + Строка.ИтоговаяСтоимость;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				Если Сумма > 10000 Тогда
					Объект.ПерсональнаяСкидка = Истина;
					Клинт[инд].ПерсональнаяСкидка = 10;
					Клинт.Записать();
				Иначе
					Объект.ПерсональнаяСкидка = Ложь;
					Клинт[инд].ПерсональнаяСкидка = 0;
					Клинт.Записать();
				КОнецЕсли;
				Объект.Записать();
				НайденнаяДата = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если НайденнаяДата Тогда
			ДобавитьКлиента();
			Клиент.Записать();
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

Функция ПодсчетДаты()
	ПредыдущаяДата = ТекущаяДата() - 30*24*60*60;
	Если День(ТекущаяДата()) < День(ПредыдущаяДата) Тогда
		ПредыдущаяДата = ПредыдущаяДата - 24*60*60; 	
	КонецЕсли;
	Возврат ПредыдущаяДата; 
КонецФункции

Процедура ДобавитьКлиента()
	Клиент = Справочники.Клиент.СоздатьГруппу();
	Клиент.Наименование = ФИО;
	Клиент.ДатаРождения = ДатаРождения;
	Клиент.Телефон = Телефон;
	Клиент.ЭлПочта = ЭлПочта;
	Клиент.ПерсональнаяСкидка = Ложь;
	Клиент.УстановитьНовыйКод();
	Клиент.Записать();
КонецПроцедуры